SpenceKonde/ATTinyCore/avr/cores/tiny/Arduino.h
#ifndef Arduino_h
#define Arduino_h

#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <math.h>
#include "BasicMacros.h"

#include <avr/pgmspace.h>
#include <avr/io.h>
#include <avr/interrupt.h>

#include "binary.h"

#ifdef __cplusplus
  extern "C"{
#endif

#ifndef ATTINYCORE
  #define ATTINYCORE "2.x.x+ unknown"
#endif


#define ADC_ERROR_NO_ADC          -32768
#define ADC_ERROR_DISABLED        -32767 /* ADC_ERROR_NO_ADC + 1 */
#define ADC_ERROR_BUSY            -32766 /* ADC_ERROR_NO_ADC + 2 */
#define ADC_ERROR_NOT_A_CHANNEL   -32765 /* ADC_ERROR_NO_ADC + 3 */
#define ADC_ERROR_SINGLE_END_IPR  -32764 /* ADC_ERROR_NO_ADC + 4 */

#ifndef USING_BOOTLOADER
  #define USING_BOOTLOADER 0
#endif


#if (F_CPU < 1000000L)
  //Prevent a divide by 0 is
  #warning "Clocks per microsecond < 1. To prevent divide by 0, it is rounded up to 1."
  #define clockCyclesPerMicrosecond() 1UL
#else
  #define clockCyclesPerMicrosecond() (F_CPU / 1000000UL)
#endif

#define ADC_CH(x) (0x80 | (x))

//#define clockCyclesToMicroseconds(a) (((a) * 1000L) / (F_CPU / 1000L))
//#define microsecondsToClockCycles(a) (((a) * (F_CPU / 1000L)) / 1000L)



typedef unsigned int word;


typedef uint8_t boolean;
typedef uint8_t byte;

void initToneTimer(void);
void init(void);

int main() __attribute__((weak));

void pinMode(uint8_t pinNumber, uint8_t mode);
void digitalWrite(uint8_t pinNumber, uint8_t val);
int8_t digitalRead(uint8_t pinNumber);
/* Copy of the ones on the modern AVR cores I maintain */
void openDrain(uint8_t pin, uint8_t mode);

/*
I CANNOT get these to compile as always inline and I cannot for the life of me figure out why I can't here and can on DxCore and megaTinyCore!

void openDrainFast(uint8_t pin, uint8_t mode);
int8_t digitalReadFast(uint8_t pinNumber);
void pinModeFast(uint8_t pinNumber, uint8_t mode);
void digitalWriteFast(uint8_t pinNumber, uint8_t val);
#if defined(PUEA)
  void digitalWriteFaster(uint8_t pinNumber, uint8_t val);
  //Ignores the pullup register. Helps as great deal on the 841. Makes less difference to 1634 and 828 which have PUE regs in the low IO space.
#endif
*/

int analogRead(uint8_t pinNumber);
#ifdef SLEEP_MODE_ADC
  int analogRead_NR(uint8_t pin);
  int _analogRead(uint8_t pin, bool use_noise_reduction);
#else
  int _analogRead(uint8_t pin);
#endif
void analogReference(uint8_t mode);
void analogWrite(uint8_t pinNumber, int16_t val);

void setADCDiffMode(bool bipolar);
void analogGain(uint8_t gain);

unsigned long millis(void);
unsigned long micros(void);

void yield(void);
void delay(unsigned long);
void delayMicroseconds(unsigned int us);

unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout);
unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout);

void shiftOut(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder, uint8_t val);
uint8_t shiftIn(uint8_t dataPin, uint8_t clockPin, uint8_t bitOrder);

void attachInterrupt(uint8_t interrupt, void (*)(void), int mode);
void detachInterrupt(uint8_t interrupt);

void setup(void);
void loop(void);

// Compile-time error checking functions

void badArg(const char*) __attribute__((error("")));
// badArg is when we can determine at compile time that an argument is inappropriate.

void badCall(const char*) __attribute__((error("")));
// badCall is used when the function should not be called, period, under those conditions.

inline __attribute__((always_inline)) void check_constant_pin(uint8_t pin)
{
  if(!__builtin_constant_p(pin))
    badArg("Fast digital pin must be a constant");
}


// Get the bit location within the hardware port of the given virtual pin.
// This comes from the pins_*.c file for the active board configuration.

extern const uint8_t PROGMEM port_to_mode_PGM[];
extern const uint8_t PROGMEM port_to_input_PGM[];
extern const uint8_t PROGMEM port_to_output_PGM[];


extern const uint8_t PROGMEM digital_pin_to_port_PGM[];
extern const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[];
extern const uint8_t PROGMEM digital_pin_to_timer_PGM[];

// Get the bit location within the hardware port of the given virtual pin.
// This comes from the pins_*.c file for the active board configuration.
// These perform slightly better as macros compared to inline functions

#define const_array_or_pgm_(FUNC,ARR,IDX) ({size_t idx_ = (IDX); __builtin_constant_p((ARR)[idx_]) ? (ARR)[idx_] : FUNC((ARR)+idx_); })
#define digitalPinToPort(P)     (((P) < NUM_DIGITAL_PINS) ? const_array_or_pgm_(pgm_read_byte, digital_pin_to_port_PGM, (P)) : NOT_A_PORT)
#define digitalPinToBitMask(P)  (((P) < NUM_DIGITAL_PINS) ? const_array_or_pgm_(pgm_read_byte, digital_pin_to_bit_mask_PGM, (P)) : NOT_A_PIN)
#define digitalPinToTimer(P)    (const_array_or_pgm_(pgm_read_byte, digital_pin_to_timer_PGM, (P)))
#define analogInPinToBit(P)     (P)
#define portOutputRegister(P)   ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_output_PGM, (P))))
#define portInputRegister(P)    ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_input_PGM, (P))))
#define portModeRegister(P)     ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_mode_PGM, (P))))
#if defined(PUEA)
  #define portPullupRegister(P) ((volatile uint8_t *)(uint16_t)(const_array_or_pgm_(pgm_read_byte, port_to_pullup_PGM, (P))))
#endif

#define NOT_A_PIN     255
#define NOT_A_TIMER   255 /* Not the same as NOT_ON_TIMER */
#define NOT_A_PORT    0   /* Different from modern AVR!   */
#define NOT_A_CHANNEL 127

#define PA 1
#define PB 2
#define PC 3
#define PD 4

#define NOT_ON_TIMER 0
#define TIMER0A 1
#define TIMER0B 2
#define TIMER1A 3
#define TIMER1B 4
#define TIMER2A 5
#define TIMER2B 6
#define TIMER1D 7

/* This is TRICKY
  We need the bitmask, not bit position when we use this.
  The analogWrite() function is going to need to know the
  timer + channel AND the TOCC bitmask, with the minimum
  possible effort. In this case, the byte breaks down as:

  0b tttt s ccc

  Where:
  c is the timer channel (see above defines)
  t is (1 << (TOCCnumber & 0x03)) - that is 0b0001, 0b0010, 0b0100, or 0b1000
  s is 0 if TOCCnumber < 4, otherwise 1
  The left/rightshift 4 positions is only 2 clocks - 1 for a swp instruction
  1 for andi 0xF0/0x0F (depending on direction of shift), whild 4 actual left/ri

  So timer number = TOCCn & 0x07, and
  TOCC mask = TOCCn & 0xF0 >> (TOCCn & 0x08)?4:0
*/
#if defined(TOCPMCOE)
  #define TOCC0  (0x10)
  #define TOCC1  (0x20)
  #define TOCC2  (0x40)
  #define TOCC3  (0x80)
  #define TOCC4  (0x18)
  #define TOCC5  (0x28)
  #define TOCC6  (0x48)
  #define TOCC7  (0x88)
#endif

/*  Timer1 on the ATtiny167/ATtiny87 can output an
  identical waveform on one or more of 4 pins per
  channel. Implementing this was faster than making
  an actual "decision" */
#if defined(OC1AX)
  #define TIM1AU (0x18 | 3)
  #define TIM1AV (0x28 | 3)
  #define TIM1AW (0x48 | 3)
  #define TIM1AX (0x88 | 3)
  #define TIM1BU (0x14 | 4)
  #define TIM1BV (0x24 | 4)
  #define TIM1BW (0x44 | 4)
  #define TIM1BX (0x84 | 4)
#endif
#include "pins_arduino.h"

// 99% of parts have the whole USI on one port. 1634 doesn't! Here, if pins_arduino.h has
// defined a separate clock DDR, we leave it, otherwise point these defines at same port as
// the data lines. We also use the pin definitions to generate SPI and TWI pin mappings.

#ifndef USI_CLOCK_DDR
  #define USI_CLOCK_DDR   USI_DDR
  #define USI_CLOCK_PORT  USI_PORT
  #define USI_CLOCK_PIN   USI_PIN
#endif
#if defined(USI_PUE) && !defined(USI_CLOCK_PUE)
  #define USI_CLOCK_PUE   USI_PUE
#endif

// If these are defined by pins_arduino, then it's not a USI-based part

#ifndef SCK
  #define MOSI  USI_DO
  #define MISO  USI_DI
  #define SCK   USI_SCK
#endif

#ifndef SCL
  #define SDA   USI_DI
  #define SCL   USI_SCK
#endif


/*=============================================================================
 * From what we got in pins_arduino.h as well as defines passed to the compiler from board submenu
 * options, determine which features to enable.
=============================================================================*/

#ifndef USE_SOFTWARE_SERIAL
  // Don't use builtin software serial unless the variant asked for it because there wasn't a hardware one.
  #define USE_SOFTWARE_SERIAL                       0
#endif

/* As of ATTinyCore 2.0.0, we have abandoned the pretense of the variant being
 * able to choose whichever timer it wants for millis. I'm not sure how far back
 * one would need to go to find a version of ATTinyCore where that worked
 * but I am damned sure it doesn't work correctly now. So we will no longer
 * include a TIMER_TO_USE_FOR_MILLIS option that might as well be named
 * SET_THIS_TO_0_OR_NOTHING_WORKS.
 *---------------------------------------------------------------------------*/

#ifndef TIMER_TO_USE_FOR_MILLIS
  #define TIMER_TO_USE_FOR_MILLIS                   0
#endif

#if defined(DISABLE_MILLIS)
  #define MILLIS_USE_TIMERNONE
  // forwards compatibility
#else
  // So you can test #ifdef millis
  #define millis millis
  #define micros micros
#endif

#if TIMER_TO_USE_FOR_MILLIS != 0
  #if !defined(DISABLE_MILLIS)
    #warning "Millis not disabled, and set to use a non-standard timer. This code has not been exercised since at least 2016!"
  #else
    #warning "Non-standard timer arrangement selected. This code has not been exercised since at least 2016!"
  #endif
#endif

#if NUM_ANALOG_INPUTS > 0
  #ifndef ADCSRA
    #error "STOP - NUM_ANALOG_INPUTS is not 0, but no ADC present on chip. This indicates a critical defect in ATTinyCore which should be reported promptly."
  #endif
  #define HAVE_ADC                                  1
  #ifndef INITIALIZE_ADC
    #ifndef DEFAULT_INITIALIZE_ADC
      #define INITIALIZE_ADC                        1
    #else
      #define INITIALIZE_ADC                        DEFAULT_INITIALIZE_ADC
    #endif
  #endif
#else
  #if defined(INITIALIZE_ADC)
    #if INITIALIZE_ADC != 0
      #error "STOP - Variant requested that the ADC be initialized, but this part does not have one (NUM_ANALOG_INPUTS == 0). This indicates a critical defect in ATTinyCore which should be reported promptly."
    #endif
    #undef INITIALIZE_ADC
  #endif
  #define INITIALIZE_ADC                            0
#endif

#ifndef INITIALIZE_SECONDARY_TIMERS
  #ifdef DEFAULT_INITIALIZE_SECONDARY_TIMERS
    #define INITIALIZE_SECONDARY_TIMERS             DEFAULT_INITIALIZE_SECONDARY_TIMERS
  #else
    #define INITIALIZE_SECONDARY_TIMERS             1
  #endif
#endif

#ifndef TIMER_TO_USE_FOR_TONE
  #if TIMER_TO_USE_FOR_MILLIS == 0
    #define TIMER_TO_USE_FOR_TONE                   1
  #else
    #define TIMER_TO_USE_FOR_TONE                   0
  #endif
#else
  #if TIMER_TO_USE_FOR_TONE == TIMER_TO_USE_FOR_MILLIS && !defined(DISABLE_MILLIS)
    #error "Tone and millis are set to use the same timer. This is unsupported. If you did not modify the core files, this is defect in ATTinyCore and should be reported promptly."
  #endif
#endif
#ifdef __cplusplus
  } // extern "C"
#endif

#ifdef __cplusplus
  #include "WCharacter.h"
  #include "WString.h"
  #include "HardwareSerial.h"
  #include "TinySoftwareSerial.h"

  uint16_t makeWord(uint16_t w);
  uint16_t makeWord(byte h, byte l);

  #define word(...) makeWord(__VA_ARGS__)
  unsigned long pulseIn(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);
  unsigned long pulseInLong(uint8_t pin, uint8_t state, unsigned long timeout = 1000000L);

  void tone(uint8_t _pin, unsigned long frequency, unsigned long duration = 0);
  void noTone(uint8_t _pin = 255);

  // WMath prototypes
  long random(long);
  long random(long, long);
  void randomSeed(unsigned int);
  long map(long, long, long, long, long);

#endif

/* SIGRD is missing from some of the IO headers, where it should
 * be defined as 5 for most parts. It is sometimes omitted entirely
 * and sometimes named RSIG. It is not present at all for some parts
 * and it's unknown at this time whether that feature didn't exist
 * and there was literally no way for the part to read it's own signature
 * or if they just couldn't be bothered to document it. Because it is often
 * missing from the headers for parts that do have it, we define it everywhere.

These call it SIGRD:
ATtiny167, ATtiny87

These call it RSIG:
ATtiny1634, ATtiny24*, ATtiny25, ATtiny4313, ATtiny44*, ATtiny441, ATtiny45, ATtiny828, ATtiny84*, ATtiny841, ATtiny85

* datasheet doesn't mention it, and in fact lists just 5 valid combinations of of SPMCSR bits, that will have any effect
...

These don't list it, but the datasheet says they support it:
ATtiny43U, ATtiny24A, ATtiny44A, ATtiny84A

These don't list it in either place:
ATtiny48, ATtiny88, All x61 family

It really makes one wonder about the documentation folks (and this section is all copypasta). There's only one way to get the answer:

#define SECTION_FUSE_LOCK 0x09
#define SECTION_SIGROW 0x21

uint8_t readSpecialSection(uint16_t addr, uint8_t section) { /
  if((section == 0x21 || section == 0x09))
  uint8_t result = (1 << section) | 1;
  __asm__ __volatile__ (
    "sts %[spmcsr], %[result]"  "\n\t"
    "lpm %[result], Z"          "\n\t"
  : [result] "+r" (result)
  : [spmcsr] "i" (_SFR_MEM_ADDR(__SPM_REG)),
    "z" (addr)
  );
  return result;
}

void setup() {
  Serial.begin(9600);
  for (uint16 i; i < 16; i++) {
    uint8_t result = readSpecialSection(i, SECTION_FUSE_LOCK)
    Serial.printHex(result);
  }
  for (uint16 i; i < 16; i++) {
    uint8_t result = readSpecialSection(i, SECTION_FUSE_LOCK)
    Serial.printHex(result);
  }
}
void loop() {
  ;
}


 * so it's unfortunate that they did named it so inconsistently.   */
#ifndef SIGRD
  #ifndef RSIG
    #define SIGRD 5
    #define RSIG 5
  #else
    #define SIGRD RSIG
  #endif
#else
  #ifndef RSIG
    #define RSIG SIGRD
  #endif
#endif

/*---------------------------------------------------------------------------
 * Aliases for the interrupt service routine vector numbers so the code
 * (core and app) doesn't have to be riddled with quite as many ifdefs
 * Why couldn't they have picked one naming convention and stuck to it?
 * TIMn or TIMERn - they're both perfectly fine naming conventions...
 * And it would also have been okay if the decision of which to use was based
 * on whether it was a normal timer or a funky one (like the high speed timers)
 * But as far as I can tell, it was based on release date or coin flip.
 * For minimum pain to users, we go both directions.
 *---------------------------------------------------------------------------*/

#if defined(TIM0_CAPT_vect)   && !defined(TIMER0_CAPT_vect)
  #define TIMER0_CAPT_vect TIM0_CAPT_vect
#endif
#if defined(TIM0_COMPA_vect)  && !defined(TIMER0_COMPA_vect)
  #define TIMER0_COMPA_vect TIM0_COMPA_vect
#endif
#if defined(TIM0_COMPB_vect)  && !defined(TIMER0_COMPB_vect)
  #define TIMER0_COMPB_vect TIM0_COMPB_vect
#endif
#if defined(TIM0_OVF_vect)    && !defined(TIMER0_OVF_vect)
  #define TIMER0_OVF_vect TIM0_OVF_vect
#endif
#if defined(TIM1_CAPT_vect)   && !defined(TIMER1_CAPT_vect)
  #define TIMER1_CAPT_vect TIM1_CAPT_vect
#endif
#if defined(TIM1_COMPA_vect)    && !defined(TIMER1_COMPA_vect)
  #define TIMER1_COMPA_vect TIM1_COMPA_vect
#endif
#if defined(TIM1_COMPB_vect)    && !defined(TIMER1_COMPB_vect)
  #define TIMER1_COMPB_vect TIM1_COMPB_vect
#endif
#if defined(TIM1_OVF_vect)      && !defined(TIMER1_OVF_vect)
  #define TIMER1_OVF_vect TIM1_OVF_vect
#endif
#if defined(TIM2_CAPT_vect)     && !defined(TIMER2_CAPT_vect)
  #define TIMER2_CAPT_vect TIM2_CAPT_vect
#endif
#if defined(TIM2_COMPA_vect)    && !defined(TIMER2_COMPA_vect)
  #define TIMER2_COMPA_vect TIM2_COMPA_vect
#endif
#if defined(TIM2_COMPB_vect)    && !defined(TIMER2_COMPB_vect)
  #define TIMER2_COMPB_vect TIM2_COMPB_vect
#endif
#if defined(TIM2_OVF_vect)      && !defined(TIMER2_OVF_vect)
  #define TIMER2_OVF_vect TIM2_OVF_vect
#endif

// Now the other direction...
#if defined(TIMER0_CAPT_vect)   && !defined(TIM0_CAPT_vect)
  #define TIM0_CAPT_vect TIMER0_CAPT_vect
#endif
#if defined(TIMER0_COMPA_vect)  && !defined(TIM0_COMPA_vect)
  #define TIM0_COMPA_vect TIMER0_COMPA_vect
#endif
#if defined(TIMER0_COMPB_vect)  && !defined(TIM0_COMPB_vect)
  #define TIM0_COMPB_vect TIMER0_COMPB_vect
#endif
#if defined(TIMER0_OVF_vect)    && !defined(TIM0_OVF_vect)
  #define TIM0_OVF_vect TIMER0_OVF_vect
#endif
#if defined(TIMER1_CAPT_vect)   && !defined(TIM1_CAPT_vect)
  #define TIM1_CAPT_vect TIMER1_CAPT_vect
#endif
#if defined(TIMER1_COMPA_vect)  && !defined(TIM1_COMPA_vect)
  #define TIM1_COMPA_vect TIMER1_COMPA_vect
#endif
#if defined(TIMER1_COMPB_vect)  && !defined(TIM1_COMPB_vect)
  #define TIM1_COMPB_vect TIMER1_COMPB_vect
#endif
#if defined(TIMER1_OVF_vect)    && !defined(TIM1_OVF_vect)
  #define TIM1_OVF_vect TIMER1_OVF_vect
#endif
#if defined(TIMER2_CAPT_vect)   && !defined(TIM2_CAPT_vect)
  #define TIM2_CAPT_vect TIMER2_CAPT_vect
#endif
#if defined(TIMER2_COMPA_vect)  && !defined(TIM2_COMPA_vect)
  #define TIM2_COMPA_vect TIMER2_COMPA_vect
#endif
#if defined(TIMER2_COMPB_vect)  && !defined(TIM2_COMPB_vect)
  #define TIM2_COMPB_vect TIMER2_COMPB_vect
#endif
#if defined(TIMER2_OVF_vect)    && !defined(TIM2_OVF_vect)
  #define TIM2_OVF_vect TIMER2_OVF_vect
#endif

#endif
